app/controllers/tokens_controller.rb

INSERT INTO "oauths" ("token", "secret") VALUES ($1, $2) RETURNING "id"  [["token", "kydICAAAAAAAg9boAAABTw5U5co"], ["secret", "AJv2oZGN9TBsaALgXbbEid8iBCzbLYdz"]]
---
  def request_token
    request_token = TWITTER.get_request_token(oauth_callback: ENV['OAUTH_CALLBACK'])
    Oauth.create(token: request_token.token, secret: request_token.secret)

SELECT  "oauths".* FROM "oauths" WHERE "oauths"."token" = $1 LIMIT 1  [["token", "kydICAAAAAAAg9boAAABTw5U5co"]]
INSERT INTO "users" ("uid", "handle", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["uid", "340483469"], ["handle", "ryan_au"], ["created_at", "2015-08-08 17:21:33.282339"], ["updated_at", "2015-08-08 17:21:33.282339"]]
SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT 1  [["uid", "340483469"]]
---
  def access_token
    oauth = Oauth.find_by(token: params[:oauth_token])
    if oauth.present?
      request_token = OAuth::RequestToken.new(TWITTER, oauth.token, oauth.secret)
      access_token = request_token.get_access_token(oauth_verifier: params[:oauth_verifier])
      user = User.find_or_create_by(uid: access_token.params[:user_id]) { |u| u.handle = access_token.params[:screen_name] }