app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password") VALUES ($1, $2) RETURNING "id"  [["username", "test"], ["password", "test"]]
SELECT COUNT(*) FROM "users"
---
  def create
      @user = User.new(username: "test", password: "test")
      if @user.save
        users = User.all.count