app/controllers/users_controller.rb

  def index
    users = User.all.count
---
SELECT COUNT(*) FROM "users"

  def update
    @current_user.update_attributes(info_params)
---
UPDATE "users" SET "risk_preference" = $1, "age" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["risk_preference", 37], ["age", 52], ["updated_at", "2015-08-08 18:57:24.517536"], ["id", 1]]